## Exercise:

Given a DataFrame employees_df with the following columns:

    emp_id (int): Employee ID
    event_day (date): The day at which the event happened
    in_time (int): The minute at which the employee entered the office
    out_time (int): The minute at which the employee left the office

Calculate the total time in minutes spent by each employee on each day at the office. Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.

Return a DataFrame with columns 'day', 'emp_id', and 'total_time' in any order.

In [7]:
import pandas as pd
# Create the Logins DataFrame
data = {'emp_id': [1, 1, 1, 2, 2],
        'event_day': ['2020-11-28', '2020-11-28', '2020-12-03', '2020-11-28', '2020-12-09'],
        'in_time': [4, 55, 1, 3, 47],
        'out_time': [32, 200, 42, 33, 74]}
df = pd.DataFrame(data)
df.head()

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [8]:
df.describe()

         emp_id    in_time    out_time
count  5.000000   5.000000    5.000000
mean   1.400000  22.000000   76.200000
std    0.547723  26.645825   71.275522
min    1.000000   1.000000   32.000000
25%    1.000000   3.000000   33.000000
50%    1.000000   4.000000   42.000000
75%    2.000000  47.000000   74.000000
max    2.000000  55.000000  200.000000

In [9]:
df.dtypes

emp_id        int64
event_day    object
in_time       int64
out_time      int64
dtype: object

In [10]:
df.columns

Index(['emp_id', 'event_day', 'in_time', 'out_time'], dtype='object')

In [11]:
df["event_day"] = pd.to_datetime(df["event_day"])

In [12]:
df.dtypes

emp_id                int64
event_day    datetime64[ns]
in_time               int64
out_time              int64
dtype: object

In [14]:
day_emp_agg = df.groupby(["emp_id", "event_day"]).agg({'in_time': 'sum', 'out_time': 'sum'}).reset_index()
day_emp_agg

   emp_id  event_day  in_time  out_time
0       1 2020-11-28       59       232
1       1 2020-12-03        1        42
2       2 2020-11-28        3        33
3       2 2020-12-09       47        74

In [15]:
day_emp_agg['total_time'] = day_emp_agg['out_time'] - day_emp_agg['in_time']
day_emp_agg

   emp_id  event_day  in_time  out_time  total_time
0       1 2020-11-28       59       232         173
1       1 2020-12-03        1        42          41
2       2 2020-11-28        3        33          30
3       2 2020-12-09       47        74          27

In [16]:
day_emp_agg.columns

Index(['emp_id', 'event_day', 'in_time', 'out_time', 'total_time'], dtype='object')

In [25]:
output_cols = ['event_day', 'emp_id', 'total_time']
output_df = day_emp_agg[output_cols].rename(columns={'event_day': 'day'})
output_df

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-12-03       1          41
2 2020-11-28       2          30
3 2020-12-09       2          27

In [26]:
output_df

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-12-03       1          41
2 2020-11-28       2          30
3 2020-12-09       2          27

Expected
| day        | emp_id | total_time |
| ---------- | ------ | ---------- |
| 2020-11-28 | 1      | 173        |
| 2020-12-03 | 1      | 41         |
| 2020-11-28 | 2      | 30         |
| 2020-12-09 | 2      | 27         |